; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v8 ?v7)
             (pred_4 ?v13 ?v6)
             (pred_11 ?v8 ?v6)
             (pred_6 ?v9 ?v8 )
	     (pred_3 ?v8)
             (pred_9 ?v12)
             (pred_1 ?v13)
             (pred_10 ?v6)
             (pred_7 ?v8)
             (pred_12 ?v13)
             (pred_8 ?v8)
             (pred_5 ))



(:action op_3
:parameters (?v3 ?v11 ?v2 ?v5)
:precondition (and (pred_9 ?v3) (pred_9 ?v11) (pred_1 ?v2) (pred_10 ?v5)
          (pred_2 ?v3 ?v11) (pred_4 ?v2 ?v5)
                   (pred_11 ?v11 ?v5) (pred_3 ?v3) 
                   (pred_7 ?v11) (pred_12 ?v2))
:effect (and  (pred_8 ?v11) (not (pred_7 ?v11))))


(:action op_2
:parameters (?v3 ?v1)
:precondition (and (pred_9 ?v3) (pred_9 ?v1)
               (pred_3 ?v3) (pred_2 ?v3 ?v1) (pred_8 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v3))))

(:action op_4
:parameters (?v3 ?v2)
:precondition (and (pred_9 ?v3) (pred_1 ?v2) 
                  (pred_3 ?v3) (pred_6 ?v2 ?v3) (pred_5 ))
:effect (and (pred_12 ?v2)
   (not (pred_6 ?v2 ?v3)) (not (pred_5 ))))


(:action op_1
:parameters (?v3 ?v4 ?v10)
:precondition (and (pred_9 ?v3) (pred_1 ?v4) (pred_1 ?v10)
                  (pred_3 ?v3) (pred_12 ?v10) (pred_6 ?v4 ?v3))
:effect (and (pred_12 ?v4) (pred_6 ?v10 ?v3)
        (not (pred_12 ?v10)) (not (pred_6 ?v4 ?v3))))

(:action op_5
:parameters (?v3 ?v2)
:precondition (and (pred_9 ?v3) (pred_1 ?v2) 
                  (pred_3 ?v3) (pred_12 ?v2))
:effect (and (pred_5 ) (pred_6 ?v2 ?v3) (not (pred_12 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_30 obj_21 obj_27 obj_13 obj_14 obj_24 obj_20 obj_26 obj_01 obj_29 obj_15 obj_18 obj_08 obj_16 obj_07 obj_06 obj_03 obj_31 obj_17 obj_22 obj_10 obj_23 obj_28 obj_04 obj_09
    obj_25 obj_19 obj_12
    obj_02 obj_05 obj_11
    )

    (:init
       (pred_5)

       (pred_9 obj_30)
       (pred_9 obj_21)
       (pred_9 obj_27)
       (pred_9 obj_13)
       (pred_9 obj_14)
       (pred_9 obj_24)
       (pred_9 obj_20)
       (pred_9 obj_26)
       (pred_9 obj_01)
       (pred_9 obj_29)
       (pred_9 obj_15)
       (pred_9 obj_18)
       (pred_9 obj_08)
       (pred_9 obj_16)
       (pred_9 obj_07)
       (pred_9 obj_06)
       (pred_9 obj_03)
       (pred_9 obj_31)
       (pred_9 obj_17)
       (pred_9 obj_22)
       (pred_9 obj_10)
       (pred_9 obj_23)
       (pred_9 obj_28)
       (pred_9 obj_04)
       (pred_9 obj_09)
       (pred_10 obj_25)
       (pred_10 obj_19)
       (pred_10 obj_12)
       (pred_1 obj_02)
       (pred_1 obj_05)
       (pred_1 obj_11)

       (pred_2 obj_30 obj_24)
       (pred_2 obj_30 obj_21)
       (pred_2 obj_21 obj_20)
       (pred_2 obj_21 obj_27)
       (pred_2 obj_21 obj_30)
       (pred_2 obj_27 obj_26)
       (pred_2 obj_27 obj_13)
       (pred_2 obj_27 obj_21)
       (pred_2 obj_13 obj_01)
       (pred_2 obj_13 obj_14)
       (pred_2 obj_13 obj_27)
       (pred_2 obj_14 obj_29)
       (pred_2 obj_14 obj_13)
       (pred_2 obj_24 obj_15)
       (pred_2 obj_24 obj_20)
       (pred_2 obj_24 obj_30)
       (pred_2 obj_20 obj_18)
       (pred_2 obj_20 obj_26)
       (pred_2 obj_20 obj_21)
       (pred_2 obj_20 obj_24)
       (pred_2 obj_26 obj_08)
       (pred_2 obj_26 obj_01)
       (pred_2 obj_26 obj_27)
       (pred_2 obj_26 obj_20)
       (pred_2 obj_01 obj_16)
       (pred_2 obj_01 obj_29)
       (pred_2 obj_01 obj_13)
       (pred_2 obj_01 obj_26)
       (pred_2 obj_29 obj_07)
       (pred_2 obj_29 obj_14)
       (pred_2 obj_29 obj_01)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_15 obj_18)
       (pred_2 obj_15 obj_24)
       (pred_2 obj_18 obj_03)
       (pred_2 obj_18 obj_08)
       (pred_2 obj_18 obj_20)
       (pred_2 obj_18 obj_15)
       (pred_2 obj_08 obj_31)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_08 obj_26)
       (pred_2 obj_08 obj_18)
       (pred_2 obj_16 obj_17)
       (pred_2 obj_16 obj_07)
       (pred_2 obj_16 obj_01)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_07 obj_22)
       (pred_2 obj_07 obj_29)
       (pred_2 obj_07 obj_16)
       (pred_2 obj_06 obj_10)
       (pred_2 obj_06 obj_03)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_03 obj_23)
       (pred_2 obj_03 obj_31)
       (pred_2 obj_03 obj_18)
       (pred_2 obj_03 obj_06)
       (pred_2 obj_31 obj_28)
       (pred_2 obj_31 obj_17)
       (pred_2 obj_31 obj_08)
       (pred_2 obj_31 obj_03)
       (pred_2 obj_17 obj_04)
       (pred_2 obj_17 obj_22)
       (pred_2 obj_17 obj_16)
       (pred_2 obj_17 obj_31)
       (pred_2 obj_22 obj_09)
       (pred_2 obj_22 obj_07)
       (pred_2 obj_22 obj_17)
       (pred_2 obj_10 obj_23)
       (pred_2 obj_10 obj_06)
       (pred_2 obj_23 obj_28)
       (pred_2 obj_23 obj_03)
       (pred_2 obj_23 obj_10)
       (pred_2 obj_28 obj_04)
       (pred_2 obj_28 obj_31)
       (pred_2 obj_28 obj_23)
       (pred_2 obj_04 obj_09)
       (pred_2 obj_04 obj_17)
       (pred_2 obj_04 obj_28)
       (pred_2 obj_09 obj_22)
       (pred_2 obj_09 obj_04)
       (pred_7 obj_07)
       (pred_7 obj_08)
       (pred_7 obj_23)
       (pred_11  obj_07 obj_25)
       (pred_11  obj_08 obj_19)
       (pred_11  obj_23 obj_12)
       (pred_8 obj_30)
       (pred_8 obj_21)
       (pred_8 obj_27)
       (pred_8 obj_13)
       (pred_8 obj_14)
       (pred_8 obj_24)
       (pred_8 obj_20)
       (pred_8 obj_26)
       (pred_8 obj_01)
       (pred_8 obj_29)
       (pred_8 obj_15)
       (pred_8 obj_18)
       (pred_8 obj_16)
       (pred_8 obj_06)
       (pred_8 obj_03)
       (pred_8 obj_31)
       (pred_8 obj_17)
       (pred_8 obj_22)
       (pred_8 obj_10)
       (pred_8 obj_28)
       (pred_8 obj_04)
       (pred_8 obj_09)

       (pred_4  obj_02 obj_25)
       (pred_4  obj_05 obj_19)
       (pred_4  obj_11 obj_12)
       (pred_6 obj_02 obj_14)
       (pred_6 obj_05 obj_22)
       (pred_6 obj_11 obj_18)
       (pred_3 obj_27)
    )

    (:goal (and
       (pred_6 obj_02 obj_26)
    ))
(:constraints
  (always (not (pred_3 obj_13)))
)
)

; plan
1. (op_2 obj_27 obj_26)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_26)
   goals met: 0 of 1
2. (op_2 obj_26 obj_01)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_01)
   goals met: 0 of 1
3. (op_2 obj_01 obj_29)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_29)
   goals met: 0 of 1
4. (op_2 obj_29 obj_14)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_14)
   goals met: 0 of 1
5. (op_4 obj_14 obj_02)
   deleted: (pred_6 obj_02 obj_14) (pred_5)
   added: (pred_12 obj_02)
   goals met: 0 of 1
6. (op_2 obj_14 obj_29)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_29)
   goals met: 0 of 1
7. (op_2 obj_29 obj_01)
   deleted: (pred_3 obj_29)
   added: (pred_3 obj_01)
   goals met: 0 of 1
8. (op_2 obj_01 obj_26)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_26)
   goals met: 0 of 1
9. (op_5 obj_26 obj_02)
   deleted: (pred_12 obj_02)
   added: (pred_5) (pred_6 obj_02 obj_26)
   goals met: 1 of 1
